from pathlib import Path

FLOAT_REGEX = r"^\d*[.]?\d*$"

DATA_DIR = Path(__file__).parent.parent / "data"
DATE_FORMAT = "%d.%m.%Y"
PHONE_REX_PATTERN = r'^((8|\+374|\+994|\+995|\+375|\+7|\+380|\+38|\+996|\+998|\+993)[\- ]?)?\(?\d{3,5}\)?[\- ]?\d{1}[\- ]?\d{1}[\- ]?\d{1}[\- ]?\d{1}[\- ]?\d{1}(([\- ]?\d{1})?[\- ]?\d{1})?$'

translit_letter = {
    'а': 'a',
    'б': 'b',
    'в': 'v',
    'г': 'g',
    'д': 'd',
    'е': 'e',
    'ё': 'e',
    'ж': 'zh',
    'з': 'z',
    'и': 'i',
    'й': 'i',
    'к': 'k',
    'л': 'l',
    'м': 'm',
    'н': 'n',
    'о': 'o',
    'п': 'p',
    'р': 'r',
    'с': 'c',
    'т': 't',
    'у': 'u',
    'ф': 'f',
    'х': 'h',
    'ц': 'ce',
    'ч': 'ch',
    'ш': 'sh',
    'щ': 'shch',
    'ъ': '\"',
    'ы': 'y',
    'ь': '\'',
    'э': 'e',
    'ю': 'yu',
    'я': 'ya'
}


